package org.ligson.biz.core.user.enums;

/**
 * 返回异常映射枚举类
 */
public enum FailureCodeEnum {


    SERVICE_EXCEPTION("SERVICE_EXCEPTION", "服务异常"),

    //通用参数校验错误码
    E_PARAM_001("E_PARAM_001", "请求参数不能为空"),
    E_PARAM_002("E_PARAM_002", "请求版本号不能为空"),
    E_PARAM_003("E_PARAM_003", "应用系统编码不能为空"),
    E_PARAM_004("E_PARAM_004", "平台编码不能为空"),
    E_PARAM_005("E_PARAM_005", "字符集不能为空"),

    //-------------------------参数校验错误码------------------------------
    //客户查询接口 参数校验 错误码
    E_PARAM_006("E_PARAM_006", "客户ID不能为空"),
    E_PARAM_007("E_PARAM_007", "身份证号不能为空"),
    E_PARAM_114("E_PARAM_114", "身份证号格式错误"),
    E_PARAM_008("E_PARAM_008", "会员编号不能为空"),
    E_PARAM_009("E_PARAM_009", "是否返回客户扩展信息不能为空"),
    E_PARAM_010("E_PARAM_010", "客户信息查询类型不能为空"),
    E_PARAM_011("E_PARAM_011", "没有匹配的客户信息查询类型"),

    //注册接口 参数校验 错误码
    E_PARAM_012("E_PARAM_012", "用户名不能为空"),
    E_PARAM_013("E_PARAM_013", "密码不能为空"),
    E_PARAM_014("E_PARAM_014", "用户名类型不能为空"),
    E_PARAM_065("E_PARAM_065", "注册时，登录名类型是手机时，用户名必须和手机号参数值一致"),
    E_PARAM_066("E_PARAM_066", "注册时，登录名类型是邮箱时，用户名必须和邮箱参数值一致"),
    E_PARAM_067("E_PARAM_067", "真实姓名不能为空"),


    E_PARAM_015("E_PARAM_015", "用户名太长"),
    E_PARAM_0151("E_PARAM_0151", "部门太长"),
    E_PARAM_016("E_PARAM_016", "手机号格式错误"),
    E_PARAM_017("E_PARAM_017", "邮箱格式错误"),
    E_PARAM_0113("E_PARAM_0113", "账号格式错误,必须是手机号或者邮箱"),

    //手机重置密码
    E_PARAM_36("E_PARAM_36", "手机号不能为空"),
    E_PARAM_37("E_PARAM_37", "验证码不能为空"),
    E_PARAM_40("E_PARAM_40", "验证码类型"),

    //邮件重置密码
    E_PARAM_38("E_PARAM_38", "邮箱不能为空"),


    //发送邮件
    E_PARAM_018("E_PARAM_018", "发件人地址不能为空"),
    E_PARAM_019("E_PARAM_019", "收件人地址不能为空"),
    E_PARAM_020("E_PARAM_020", "邮件主题不能为空"),
    E_PARAM_021("E_PARAM_021", "邮件内容不能为空"),
    E_PARAM_022("E_PARAM_022", "邮件内容类型不能为空"),
    E_PARAM_023("E_PARAM_023", "不是有效的邮件地址"),
    E_PARAM_024("E_PARAM_024", "邮件主题太长"),
    E_PARAM_025("E_PARAM_025", "邮件内容太长"),

    //密码修改
    E_PARAM_026("E_PARAM_026", "新密码不能为空"),

    //添加关注
    E_PARAM_0271("E_PARAM_0271", "用户ID不是BIGINT类型"),
    E_PARAM_027("E_PARAM_027", "用户ID不能为空"),
    E_PARAM_028("E_PARAM_028", "被关注人ID不能为空"),
    E_PARAM_029("E_PARAM_029", "关系名称不能为空"),

    //查询关注
    E_PARAM_030("E_PARAM_030", "查询类型不能为空"),
    E_PARAM_031("E_PARAM_031", "排序参数不能为空"),
    E_PARAM_032("E_PARAM_032", "排序不能为空"),
    E_PARAM_033("E_PARAM_033", "分页查询分页大小不能为空"),
    E_PARAM_034("E_PARAM_034", "分页查询当前页号不能为空"),
    E_PARAM_035("E_PARAM_035", "分页查询分页大小值过大"),


    //版本
    E_PARAM_040("E_PARAM_040", "版本查询类型不能为空"),

    //护工查询
    E_PARAM_041("E_PARAM_041", "护工ID不能为空"),
    E_PARAM_042("E_PARAM_042", "工单提醒开关状态不能为空"),
    E_PARAM_043("E_PARAM_043", "工单提醒时间不能为空"),
    E_PARAM_045("E_PARAM_045", "工单提醒时间必须是正整数"),
    E_PARAM_044("E_PARAM_044", "上下班状态不能为空"),


    //图片上传
    E_PARAM_046("E_PARAM_046", "图片上传列表不能为空"),

    //图片地址保存接口
    E_PARAM_047("E_PARAM_047", "工单号不能为空"),
    E_PARAM_048("E_PARAM_048", "上传时间不能为空"),
    E_PARAM_049("E_PARAM_049", "图片序号不能为空"),
    E_PARAM_050("E_PARAM_050", "图片存储地址不能为空"),
    E_PARAM_051("E_PARAM_051", "图片描述不能为空"),
    E_PARAM_052("E_PARAM_052", "上传图片信息列表不能为空"),
    E_PARAM_059("E_PARAM_059", "图片内容不能为空"),
    E_PARAM_062("E_PARAM_062", "图片扩展名不能为空"),


    //工单列表页查询
    E_PARAM_053("E_PARAM_053", "护工ID不能为空"),
    E_PARAM_054("E_PARAM_054", "工单类型不能为空"),
    E_PARAM_055("E_PARAM_055", "工单排序不能为空"),

    //工单详情页查询
    E_PARAM_056("E_PARAM_056", "工单ID不能为空"),
    E_PARAM_057("E_PARAM_057", "工单状态显示编码不能为空"),
    E_PARAM_058("E_PARAM_058", "工单状态显示编码不合法"),

    //拒单申请
    E_PARAM_060("E_PARAM_060", "拒绝原因编码不能为空"),
    E_PARAM_061("E_PARAM_061", "其他拒绝原因不能为空"),

    //-----账户63~99-------
    //个人账户修改
    E_PARAM_063("E_PARAM_063", "账号不能为空"),
    E_PARAM_064("E_PARAM_064", "状态不能为空"),

    //智慧云
    E_PARAM_069("E_PARAM_069", "智慧云账号不能为空"),


    //修改预约时间
    E_PARAM_100("E_PARAM_100", "更改服务时间的原因不能为空"),
    E_PARAM_101("E_PARAM_101", "更改服务时间的原因字数过长"),
    E_PARAM_102("E_PARAM_102", "开始时间不能为空"),
    E_PARAM_103("E_PARAM_103", "结束时间不能为空"),
    E_PARAM_104("E_PARAM_104", "开始时间格式错误"),
    E_PARAM_105("E_PARAM_105", "结束时间格式错误"),
    E_PARAM_106("E_PARAM_106", "开始时间必须小于结束时间"),

    //收款
    E_PARAM_107("E_PARAM_107", "收款方式不能为空"),
    E_PARAM_108("E_PARAM_108", "收款金额不能为空"),
    E_PARAM_109("E_PARAM_109", "请注明原因"),
    //护工位置信息
    E_PARAM_110("E_PARAM_110", "经纬度不能为空"),
    E_PARAM_111("E_PARAM_111", "位置上传时间不能为空"),

    E_PARAM_112("E_PARAM_112", "账户类型不能为空"),
    E_PARAM_113("E_PARAM_113", "tokenId不能为空"),

    //-------------------------业务检查错误码------------------------------
    //客户查询接口 业务检查 错误码
    E_BIZ_001("E_BIZ_001", "客户基本信息不存在"),
    E_BIZ_002("E_BIZ_002", "客户扩展信息不存在"),

    //注册接口 业务检查 错误码
    E_BIZ_003("E_BIZ_003", "账号已存在"),
    E_BIZ_0031("E_BIZ_0031", "身份证号已存在"),

    E_BIZ_004("E_BIZ_004", "用户名错误"),
    E_BIZ_005("E_BIZ_005", "密码错误"),
    E_BIZ_015("E_BIZ_015", "用户状态无效"),
    E_BIZ_032("E_BIZ_032", "删除状态的用户不能修改"),

    //关注
    E_BIZ_006("E_BIZ_006", "已关注用户重复关注"),
    E_BIZ_007("E_BIZ_007", "用户不存在"),
    E_BIZ_008("E_BIZ_008", "没有关注不能设置默认显示"),
    E_BIZ_010("E_BIZ_010", "已取消关注用户重复取消关注"),
    E_BIZ_011("E_BIZ_011", "已设置默认首页显示又重复设置"),


    //发送验证码
    E_BIZ_012("E_BIZ_012", "获取验证码次数超限，每天%d次"),
    E_BIZ_034("E_BIZ_034", "手机号不属于注册用户"),

    //手机重置密码
    E_BIZ_013("E_BIZ_013", "验证码无效"),
    E_BIZ_014("E_BIZ_014", "找回密码手机号与注册手机号不一致"),


    //邮件重置密码
    E_BIZ_016("E_BIZ_016", "找回密码邮箱与注册邮箱不一致"),

    //护工信息查询
    E_BIZ_017("E_BIZ_017", "护理员不存在"),
    E_BIZ_018("E_BIZ_018", "护基本信息不存在"),


    //图片上传
    E_BIZ_019("E_BIZ_019", "护展名不能为空"),
    E_BIZ_030("E_BIZ_030", "完成服务的工单才能上传图片"),

    //图片地址保存接口
    E_BIZ_020("E_BIZ_020", "工单不存在"),

    //关注查询
    E_BIZ_021("E_BIZ_021", "查询结果数据为空"),
    E_BIZ_022("E_BIZ_022", "查询结果数据为空"),


    //接单
    E_BIZ_023("E_BIZ_023", "工单已被接"),

    //拒单
    E_BIZ_024("E_BIZ_024", "工单已开始，不允许拒绝"),
    E_BIZ_025("E_BIZ_025", "距工单预约开始时间不到1小时，不允许拒绝"),

    //收款
    E_BIZ_026("E_BIZ_026", "工单未完成，不能支付"),
    E_BIZ_027("E_BIZ_027", "工单已支付，不能再次支付"),
    E_BIZ_028("E_BIZ_028", "客户的账户不存在"),
    E_BIZ_029("E_BIZ_029", "客户的账户余额不足，请选择现金支付"),


    //护工网关
    E_BIZ_031("E_BIZ_031", "token无效"),


    //修改预约时间
    E_BIZ_100("E_BIZ_100", "该工单已改派"),
    E_BIZ_101("E_BIZ_101", "与已有工单时间有冲突"),
    E_BIZ_103("E_BIZ_103", "不能修改预约时间"),


    //护工开始工作
    E_BIZ_102("E_BIZ_102", "工单状态错误"),
    E_BIZ_106("E_BIZ_106", "该护工存在未完成工单，未完成前不能开始新工单"),

    //机构注册登录
    E_BIZ_200("E_BIZ_200", "用户不存在"),
    E_BIZ_201("E_BIZ_201", "密码错误"),
    E_BIZ_202("E_BIZ_202", "用户已存在"),
    E_BIZ_203("E_BIZ_203", "邮箱已存在"),
    E_BIZ_204("E_BIZ_204", "手机号已存在"),

    E_BIZ_104("E_BIZ_104", "传参的邮箱与登录邮箱不一致"),
    E_BIZ_105("E_BIZ_105", "传参的手机号与登录手机号不一致"),

    E_BIZ_107("E_BIZ_107", "tokenId不存在"),
    E_BIZ_108("E_BIZ_108", "旧密码不一致"),

    //-------------------------预处理错误码------------------------------
    //客户查询接口 预处理 错误码
/*	E_PROCESS_001("E_PROCESS_001","客户基本信息转储异常"),
    E_PROCESS_002("E_PROCESS_002","客户扩展信息转储异常"),*/

    //-------------------------持久化错误码------------------------------
/*	E_PERSIST_001("E_PERSIST_001","无数据持久化"),
    E_PERSIST_002("E_PERSIST_002","数据持久化异常"),*/;

    FailureCodeEnum(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    private String msg;

    private String code;

    public String getMsg() {
        return msg;
    }

    public String getCode() {
        return code;
    }

}
